{
    "title": "Proposal Presentation",
    "datetime": "6th Dec 2018",
    "content": "Yesterday, we presented our proposal to our P1 teacher. We approached the subject from a different angle this time: Using the excess computational power for good. For example, project such as Folding@Home or the Great Internet Mersenne Prime Search (GIMPS) both use distributed computing to solve research problems.<br/><br/>However, the main problem we observe (from our experience) is that people need to be willing to download the software the projects provide. In addition, the clients will also need to leave their computer on for the software to run in the background.<br/><br/>Hence, we would like to solve these two problems by making it easier to donate your computational power to support these projects.<br/><br/>Firstly, we make it easier to donate computational power by doing the computation through your browser. No additional software needs to be downloaded. If I'm not wrong, BOINC helps with this by unifying multiple projects through a common infrastructure but you still have to download their software.<br/><br/>Secondly, we use the time you spend on tasks that are not computationally intensive (such as reading an article) to do the tasks. This means that you do not need to keep your computer on to help these projects—all you have to do is just visit a site that supports the project.<br/><br/>However, before we move into the development of this solution, we will be researching more on the problem to better understand how the current infrastructure works.<br/><br/>Personally, I think that it is also a matter of how efficient computation can be done on the browser and whether the numbers match up against provided software.<hr/>During the presentation, we had only given the example of using distributed computing to disprove the Collatz Conjecture. Mr Saiful pointed out that we should mention that we are doing this not just for disproving the Collatz Conjecture but for helping other research problems as well.<br/><br/>In addition, he mentioned that we should also work on convincing the user why these problems are important to solve.<br/><br/>Our timeline is as shown:<br/><img src='posts/timeline.png' style='width:100%' />"
}
