{
    "title": "Not a very productive week...",
    "datetime": "15th Dec 2018",
    "content": "This week was the common test week, so, I spent most of my time studying for the common test. With the rest of the days I looked up how does BOINC work. I found their <a href='https://boinc.berkeley.edu/trac/wiki/ProjectMain'>comprehensive documentation</a> on how to create a BOINC project, as well as some hint to how it works.<br/><br/>BOINC provides a few different options for how a project manager may want to go about implementing his project.<br/>The first way is through the <a href='https://boinc.berkeley.edu/trac/wiki/BasicApi'>native API</a>. BOINC provides a set of C++ API which one can include in their own project so that once the work unit is done, it can call on the BOINC APIs.<br/>The second way is to <a href='https://boinc.berkeley.edu/trac/wiki/VboxApps'>run the work units in a VirtualBox virtual machine</a>. This allows the app to be cross platform, but to a certain extent. VirtualBox only runs on Intel-compatible processors and GPU apps don't work in the VMs.<br/>Lastly you can run apps in Docker. Docker is a containerisation software that runs programs in small virtual environments. The main benefit for Docker applications is that it is even easier to create Docker applications as compared to the previous to methods. Docker can create an environment for you to run your program in and it will run on any platform, just like a virtual machine. However, it has similar downsides to VirtualBox apps, no GPUs (for now), Intel compatibility and a few other things.<br/><br/>From this, it seems that developing software for BOINC can be hard. If you want to support all platforms, or just use a GPU, developing in C++ and compiling to the different platforms seems to be the only way. That's not easy.<br/><br/>Anyway, as to how BOINC works, it seems that they offer both client and server side support. Client APIs for making apps and server software for receiving the results from clients. There are a few details such as ensuring the security and project management. All in all, I think this hints that it is important to make extensive documentation. The BOINC documentation is covers many topics, perhaps to make the implementation as smooth as possible. So, we should try to excel in this area as well."
}
