{
    "title": "Rediscovery",
    "datetime": "4th Jan 2019",
    "content": "This week, I was planning to start to work on the programming portion by translating the C++ file on BOINC's github repo. However, while skimming through the work_fetch.cpp file to try and have a high level understanding of what is going on, I found a piece of XML which it sends to the project url. I googled the piece of XML and found the documentation for the <a href='https://boinc.berkeley.edu/trac/wiki /RpcProtocol'>BOINC RPC</a>! This means that I don't need to look through their files anymore!<br/><br/>While reading through the RPC Protocol docs, I also found out that there is <a href='https: //boinc.berkeley.edu/trac/wiki/WebRpc'>another documentation for the WebRPC</a>. The RPC Protocol docs define how to fetch jobs. The WebRPC defines how to get the current status of the server, what accounts there are and other things.<br/><br/>After reading some of the docs, I also found out more about the BOINC account system. BOINC does not manage accounts for participants, each of the projects have their own account database. So, if I want to contribute to Collatz, I will have to sign up on their site and use that account to contribute. There is no central account system.<br/><br/>Since BOINC has established this distributed account system, they have also made an account manager for participants who participate in multiple different projects. So, participants only need to have 1 account which signs up for the different projects. I am not so sure what the account manager does in the back but I can only guess that it uses the same password and email for all the different projects.<br/><br/>So, we probably have to make an account manager too.<br/><br/><br/>This week was more research and reading up about how things works again, although it was not part of our intended timeline. Sean has set up a GitHub repo at <a href='https://github.com/seannich/distro'>https://github.com/seannich/distro</a>."
}
