{
    "title": "Much progress despite bad documentation",
    "datetime": "29th Jan 2019",
    "content": "Last week, I completed the CORS proxy and set up the BOINC server. I used the <a href='https://github.com/marius311/boinc-server-docker'>boinc-server-docker</a> to make the BOINC server, so that it will be platform-independent and so that I don't need to setup anything again if I were to deploy the server.<br/><br/>boinc-server-docker is made of 3 containers: apache, makeproject and mysql.<br/><br/>apache is the web server, mysql is the database. makeproject sets up all the project files and installs everything neccessary for the BOINC server to run, mainly, php and gcc, g++ compilers.<br/><br/>When I was trying to setup the server, there was a problem with the makeproject container that caused it to fail. Basically, the makeproject container runs a few shell scripts, and in one of them, there was a line to add a user, 'docker', to the same group as the docker socket. However, on Mac, this fails as the docker socket has the root group (GID 0), and no user can join the root group other than root. Since the command failed, further lines also failed.<br/><br/>So, I worked around it by creating a group with GID 999 and then changing the group of the docker socket. This is not advised for Linux as it also changes the host's docker socket's GID. More about this problem in <a href='https://github.com/marius311/boinc-server-docker/issues/53'>this issue</a>.<br/><br/>In addition to that, I wrote more code for the distro client to communicate with the BOINC server. This took a lot of time because the documentation for BOINC was poor. For example, the documentation for the RPC protocol https://boinc.berkeley.edu/trac/wiki/RpcProtocol does not say anything other than what are the possible tags (which wasn't very accurate either). So, I had to figure out what the tags to and when to send them. I also had to read the source code of the BOINC client to figure out what was going on.<br/><br/>This happened not only for the requesting for jobs, but also for uploading files and sending results (sending results was the worst).<br/><br/>Anyways, the distro client can now receive work, upload files and send results as well. What's left to do is:<ol><li>Creating work on the BOINC server</li><li>Validating work on the BOINC server</li><li>Better presentation of results (if we have time)</li></ol>I have tasked Sean to try and do 1, I'll be doing 2.<br/><br/>It's great that we also got an extension to Wednesday, if not I don't think it would have been working prototype."
}